{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 64, 8, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_1"}, "registered_name": null, "name": "input_layer_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "target_shape": [8, 192]}, "registered_name": null, "build_config": {"input_shape": [null, 64, 8, 3]}, "name": "reshape", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64, 8, 3], "dtype": "float32", "keras_history": ["input_layer_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add"}, "registered_name": "Add", "name": "add", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["reshape", 0, 0]}}, {"class_name": "__tensor__", "config": {"value": [[-0.04279731586575508, -0.03490623086690903, 0.04233170673251152, -0.012511540204286575, -0.046411287039518356, 0.03068704530596733, -0.02772418223321438, -0.04412280395627022, 0.012772131711244583, -0.013591635972261429, 0.016573037952184677, -0.03605158254504204, -0.042467664927244186, -0.04883495718240738, -0.010113049298524857, 0.025782529264688492, 0.03283759579062462, 0.0012435540556907654, -0.026048947125673294, -0.041264213621616364, 0.018022481352090836, -0.025860046967864037, -0.02870194986462593, 0.03966863080859184, 0.043498482555150986, 0.0008869543671607971, -0.014261521399021149, -0.00821756199002266, -0.01333712413907051, -0.017463527619838715, 0.04736704006791115, -0.033260323107242584, 0.013342324644327164, -0.03861113637685776, 0.017744053155183792, -0.03763488680124283, -0.04744582250714302, -0.04583550617098808, -0.027989303693175316, -0.02094259299337864, 0.020470205694437027, 0.045038942247629166, 0.01725759729743004, -0.011831093579530716, -0.029408276081085205, 0.00557776540517807, -0.04231445863842964, 0.003344617784023285, 0.028749335557222366, 0.022177565842866898, 0.03128974512219429, -0.03564798831939697, 0.003545474261045456, -0.03136865049600601, 0.041204262524843216, -0.024395262822508812, -0.038477279245853424, -0.02242140844464302, 0.04402352496981621, 0.041831228882074356, -0.023020578548312187, -0.0018095597624778748, -0.03833792358636856, -0.04872354492545128, 0.020772922784090042, -0.015580736100673676, -0.005437158048152924, -0.013291943818330765, 0.04355989769101143, 0.0417020358145237, -0.028980707749724388, 0.04706749692559242, -0.03700578212738037, 0.03546247258782387, -0.04725905880331993, 0.044558171182870865, -0.010831166058778763, 0.039677251130342484, 0.02300044521689415, 0.017485905438661575, -0.03713506460189819, 0.04024927690625191, 0.021038416773080826, 0.048925939947366714, -0.03187854588031769, 0.0036110877990722656, 0.02463705465197563, -0.019705569371581078, -0.005473054945468903, 0.044639114290475845, 0.0027695074677467346, -0.020438481122255325, 0.01302943006157875, -0.02046417072415352, -0.04685105010867119, -0.011115837842226028, -0.04575958475470543, 0.010210670530796051, 0.016496825963258743, 0.011643946170806885, 0.021565724164247513, 0.014087114483118057, 0.01331951841711998, 0.031889643520116806, -0.03217325359582901, 0.04889031872153282, 0.010354410856962204, -0.036895714700222015, 0.003605663776397705, -0.023153794929385185, 0.03849411383271217, -0.04625842720270157, 0.011805366724729538, -0.00458979606628418, 0.001984965056180954, -0.048087846487760544, 0.001743316650390625, 0.025767158716917038, 0.018431831151247025, -0.008887577801942825, -0.008186697959899902, 0.0028731822967529297, -0.010502684861421585, 0.03994869068264961, 0.01923377439379692, -0.0060443878173828125, 0.009048748761415482, -0.04211369901895523, 0.005808521062135696, 0.033055249601602554, 0.022477570921182632, -0.03164529800415039, -0.031479381024837494, -0.0491289384663105, 0.011751331388950348, 0.03552922233939171, -0.024653732776641846, 0.016659725457429886, -0.046001315116882324, -0.0264623761177063, 0.003252267837524414, 0.038774337619543076, 0.031393442302942276, 0.02134953811764717, 0.014180485159158707, 0.04990304633975029, 0.02122781053185463, 0.042782973498106, -0.03721155971288681, -0.03328670561313629, 0.003026224672794342, 0.004485726356506348, -0.00266425684094429, -0.029780983924865723, 0.04492844268679619, -0.044064294546842575, 0.013388309627771378, 0.02916613593697548, -0.015613842755556107, 0.03244880214333534, 0.020038951188325882, -0.032991863787174225, -0.04714158922433853, 0.024058748036623, -0.0012791641056537628, -0.011715926229953766, -0.04093792289495468, -0.022663449868559837, 0.01564938947558403, -0.043785929679870605, -0.012871108949184418, -0.04126087576150894, -0.047971297055482864, -0.043695118278265, 0.02759680524468422, 0.0003640875220298767, -0.04394111782312393, -0.04741647467017174, -0.04415015131235123, -0.001863636076450348, -0.0024945735931396484, -0.01123429462313652, 0.0021768584847450256, -0.02362440899014473, 0.0380249060690403, -0.03524881601333618, 0.024451587349176407, -0.0040490031242370605, 0.04826808348298073, 0.04262072965502739, 0.02758791670203209, -0.04053056240081787], [-0.03202613443136215, 0.045881275087594986, -0.0048468224704265594, 0.02228868380188942, -0.04890301451086998, -0.029751991853117943, 0.028459500521421432, 0.005956970155239105, -0.004823576658964157, -0.009361576288938522, -0.007673431187868118, -0.02747180499136448, 0.044339146465063095, 0.036448147147893906, -0.04203153774142265, -0.024621082469820976, -0.03623805195093155, 0.014672484248876572, -0.028189921751618385, 0.016884472221136093, 0.03205087408423424, -0.035537563264369965, -0.03445557504892349, 0.03172513470053673, -0.03609517961740494, -0.005638767033815384, -0.04245380312204361, -0.029758214950561523, -0.010150838643312454, 0.016765881329774857, -0.011416792869567871, -0.03438469022512436, -0.00700761005282402, -0.01876239851117134, 0.04060859605669975, 0.04557075724005699, 0.026756975799798965, -0.04732852056622505, 0.013665679842233658, -0.02305753342807293, 0.002856813371181488, 0.0412386991083622, -0.043566491454839706, -0.0242402795702219, 0.03255012258887291, -0.013645697385072708, -0.0036218054592609406, 0.04868253692984581, 0.044495608657598495, -0.0411861315369606, 0.021115150302648544, -0.044874753803014755, -0.028884340077638626, -0.042695652693510056, 0.03483860567212105, 0.03501725569367409, -0.024536920711398125, 0.02933073416352272, 0.00847604125738144, -0.006336666643619537, 0.03057355061173439, 0.03625604137778282, 0.019284497946500778, 0.005314730107784271, 0.017578568309545517, 0.016685258597135544, 0.007163845002651215, -0.014209914952516556, -0.001896630972623825, -0.012822795659303665, 0.03979196771979332, 0.004023600369691849, -0.028530491515994072, -0.009530734270811081, -0.0195496566593647, 0.009841512888669968, -0.013218212872743607, 0.005734182894229889, -0.0058471448719501495, -0.033601272851228714, -0.013769365847110748, -0.013493049889802933, -0.020911110565066338, 0.03243377432227135, 0.03443152830004692, 0.024010013788938522, 0.0031794197857379913, -0.0027408376336097717, -0.02355257235467434, 0.022800926119089127, 0.0427531935274601, 0.02771322801709175, -0.02545849047601223, 0.047183405607938766, 0.04045269265770912, 0.013797197490930557, 0.04867659881711006, -0.03057274781167507, 0.0335669182240963, 0.029290642589330673, -0.039998434484004974, -0.044688642024993896, 0.03393144533038139, 0.02413395419716835, -0.0401536226272583, -0.04659176990389824, 0.02593327686190605, -0.010185670107603073, -0.04887440428137779, -0.0129653699696064, -0.002464868128299713, 0.04704216495156288, -0.024655628949403763, -0.018719695508480072, 0.0031263455748558044, -0.01061878353357315, 0.015063408762216568, -0.04251448065042496, -0.03759206458926201, 0.0028535015881061554, 0.02536306157708168, -0.001341152936220169, 0.030659686774015427, -0.049012184143066406, 0.019455041736364365, 0.009711243212223053, -0.028806472197175026, -0.007836949080228806, 0.03951168432831764, -0.009393405169248581, -0.019768452271819115, 0.011632848531007767, -0.020250165835022926, 0.0369548536837101, 0.014170397073030472, 0.04717271402478218, 0.03132927790284157, 0.025478634983301163, 0.03909710422158241, -0.04265407472848892, 0.014854762703180313, -0.03030332364141941, 0.03034372255206108, -0.04979607090353966, -0.03859897702932358, -0.04836222156882286, 0.0490933395922184, 0.03452705219388008, 0.03008953109383583, -0.028812695294618607, -0.017734386026859283, 0.04705632105469704, 0.040507201105356216, -0.02375216595828533, -0.03731346130371094, 0.015954148024320602, -0.02177354134619236, -0.02321801148355007, -0.03487182781100273, 0.006906937807798386, 0.008694887161254883, -0.04080604389309883, -0.017452023923397064, 0.035347674041986465, 0.029277633875608444, -0.03859271854162216, 0.02530035749077797, -0.026067698374390602, -0.049301374703645706, -0.04179752990603447, 0.02267662063241005, -0.02454437129199505, 0.01829933002591133, -0.032665349543094635, -0.01589193195104599, 0.012482594698667526, -0.03901807218790054, 0.005619071424007416, -0.02848264016211033, 0.025244716554880142, 0.009287070482969284, -0.02553168497979641, -0.030908405780792236, 0.018732521682977676, 0.010734986513853073, 0.03603169694542885, -0.0030578970909118652, 0.0020625218749046326, -0.03407111018896103, 0.024087022989988327, -0.01232694461941719, 0.023255709558725357], [-0.011732898652553558, 0.03300129249691963, -0.021134769544005394, -0.04746667295694351, 0.0013368241488933563, 0.03976947441697121, -0.03717181831598282, 0.02061769738793373, -0.04708046838641167, 0.018426764756441116, -0.01718151569366455, 0.03732197359204292, 0.028553638607263565, 0.026240680366754532, 0.0012127533555030823, 0.030187401920557022, 0.03938772901892662, -0.02152479998767376, -0.004740297794342041, 0.030011747032403946, 0.020595956593751907, -0.04373381286859512, -0.029464948922395706, 0.002485908567905426, 0.016782712191343307, -0.032853446900844574, 0.04005202278494835, -0.012874256819486618, 0.045862700790166855, -0.03877905756235123, -0.017211247235536575, 0.018582653254270554, 0.04396897926926613, -0.039022840559482574, -0.011781096458435059, 0.048708926886320114, -0.01877880096435547, 0.024240795522928238, 0.023020122200250626, -0.035817861557006836, 0.043953631073236465, -0.016186963766813278, -0.025212466716766357, -0.021781206130981445, 0.04877612367272377, -0.04517298936843872, 0.02987905964255333, -0.00040589645504951477, 0.014080848544836044, 0.008548356592655182, 0.02010803297162056, 0.012140285223722458, -0.03370751440525055, 0.023086395114660263, -0.01083838939666748, -0.04324498400092125, 0.04934899881482124, -0.04849458858370781, -0.03271738439798355, 0.03110441192984581, -0.02370581589639187, 0.04604421928524971, 0.03685833141207695, -0.026429498568177223, 0.028637651354074478, 0.03581620380282402, 0.00894014909863472, 0.015429865568876266, -0.01296382024884224, 0.0015434622764587402, -0.048862673342227936, 0.027534667402505875, -0.019376004114747047, 0.020672891288995743, -0.04025088623166084, 0.017151523381471634, 0.03380448743700981, 0.0125848688185215, 0.012632083147764206, -0.025385474786162376, 0.03260843828320503, -0.009137500077486038, 0.011507999151945114, -0.005436263978481293, -0.03175227716565132, -0.0011129491031169891, 0.010003626346588135, 0.019548270851373672, -0.04382969066500664, 0.025732193142175674, 0.031607601791620255, 0.00014786794781684875, 0.04219133034348488, -0.044458068907260895, -0.01338743045926094, 0.03816765919327736, -0.01291579008102417, -0.04604591056704521, 0.011381734162569046, -0.03220038488507271, 0.02542905882000923, 0.0112471804022789, 0.04187876358628273, 0.004542313516139984, 0.0474143885076046, -0.03477512672543526, 0.02758697047829628, 0.0024577006697654724, 0.011647332459688187, 0.02146850898861885, -0.043144967406988144, 0.00380103662610054, 0.021894995123147964, -0.014648638665676117, 0.018722299486398697, -0.0034065619111061096, -0.015986431390047073, 0.03112126514315605, -0.040704332292079926, 0.043108049780130386, 0.04719341918826103, 0.0006237141788005829, 0.02613316848874092, 0.037383679300546646, 0.034947242587804794, -0.01574798673391342, -0.01745687797665596, -0.018477141857147217, -0.012846481055021286, -0.016094040125608444, 0.020162593573331833, -0.01009126752614975, -0.026629401370882988, 0.02177399769425392, 0.01207733154296875, 0.01805039867758751, -0.00023730844259262085, -0.006374381482601166, 0.01329808309674263, 0.004012249410152435, -0.0020634420216083527, -0.033222783356904984, 0.029249634593725204, 0.045091938227415085, 0.04373366758227348, -0.04348360374569893, -0.047168996185064316, 0.0029591210186481476, 0.004676390439271927, -0.010487925261259079, -0.02283576689660549, 0.02029360458254814, 0.04848294332623482, -0.03475404903292656, 0.010582875460386276, -0.04511815309524536, 0.032988596707582474, -0.04182077571749687, -0.022684156894683838, -0.007484722882509232, -0.037574805319309235, 0.04137808457016945, -0.029990602284669876, -0.022729862481355667, 0.0031300559639930725, 0.03034954145550728, -0.024168360978364944, 0.04883711412549019, 0.006038833409547806, 0.040428172796964645, 0.0362708680331707, -0.04224736616015434, -0.01806313917040825, 0.031733762472867966, 0.011197756975889206, -0.034920789301395416, 0.009768046438694, 0.030770305544137955, 0.023569736629724503, -0.04980115965008736, 0.021394338458776474, -0.03165803104639053, 0.048457395285367966, 0.03050515428185463, 0.031952980905771255, 0.0146491639316082, 0.021202359348535538, -0.036044321954250336, 0.022900689393281937, -0.04920778423547745, -0.048949409276247025, -0.02951071225106716], [0.033970240503549576, 0.029232610017061234, 0.0016778931021690369, 0.007757354527711868, 0.0217185877263546, -0.008502759039402008, 0.02368488535284996, -0.041866861283779144, -0.04255805164575577, -0.01744316890835762, 0.01812504604458809, 0.04328059032559395, -0.006948292255401611, 0.0405413843691349, -0.04853687435388565, -0.021333659067749977, 0.04408932849764824, 0.017498444765806198, -0.04535895586013794, 0.04775141552090645, 0.037292663007974625, -0.04610485956072807, -0.009845864027738571, 0.03196214511990547, -0.018292058259248734, -0.0037614107131958008, -0.044311534613370895, -0.04937213659286499, -0.031101776286959648, -0.010335564613342285, 0.021589670330286026, 0.0008537396788597107, 0.03536750003695488, 0.028610382229089737, -0.04599795490503311, 0.031536173075437546, -0.0279112346470356, -0.0034924261271953583, -0.007369674742221832, 0.01788323000073433, 0.03082355484366417, 0.01229248195886612, 0.020105648785829544, 0.04061518982052803, 0.04178110137581825, -0.005783163011074066, 0.04188578203320503, -9.310245513916016e-05, 0.03207453712821007, -0.0010399110615253448, -0.015966594219207764, -0.030373383313417435, -0.038732778280973434, 0.011951364576816559, 0.0006390586495399475, 0.03705822303891182, -0.03066657856106758, -0.03550396114587784, 0.04822900518774986, 0.023830104619264603, 0.01813283935189247, 0.018780235201120377, -0.01887267827987671, -0.044535089284181595, -0.04695957899093628, 0.0020223259925842285, 0.030594002455472946, 0.03397524729371071, 0.021461177617311478, -0.012686513364315033, -0.02434103563427925, -0.009041644632816315, 0.03261018171906471, -0.009708978235721588, 0.038718391209840775, -0.04187922552227974, 0.0032182708382606506, 0.019110072404146194, -0.038349758833646774, -0.019587267190217972, 0.01445387676358223, 0.005434274673461914, 0.017389822751283646, -0.006740104407072067, 0.03743196651339531, -0.04687441512942314, 0.03125656768679619, 0.01575632020831108, -0.004733610898256302, 0.043519821017980576, 0.036018919199705124, -0.010775446891784668, 0.03018103912472725, 0.03686949238181114, -0.012327633798122406, -0.0027060620486736298, 0.03758862242102623, 0.04870406165719032, -0.03428094461560249, 0.024314608424901962, -0.03017798624932766, -0.03666113689541817, 0.001866064965724945, -0.03297434002161026, -0.013994157314300537, -0.02032780647277832, -0.0014011040329933167, 0.02276405319571495, -0.046247780323028564, -0.00020760297775268555, -0.01618821546435356, -0.017245076596736908, -0.04315364360809326, -0.04472973570227623, -0.012271523475646973, 0.008210919797420502, -0.011238716542720795, -0.002218913286924362, 0.030030671507120132, -0.04436903074383736, -0.0015263184905052185, -0.017431925982236862, 0.04342203214764595, -0.019155263900756836, -0.013574160635471344, 0.00994647666811943, 0.03414403274655342, 0.004885662347078323, 0.0410192646086216, -0.015729308128356934, 0.0118783600628376, -0.04235025867819786, 0.03106563165783882, -0.03324864059686661, -0.009289313107728958, 0.02668968215584755, 0.01694437488913536, 0.04504629597067833, -0.022541284561157227, -0.013271510601043701, -0.035531722009181976, -0.0068413130939006805, -0.003989897668361664, 0.00843975692987442, -0.0009085163474082947, 0.02004377916455269, 0.0304546020925045, 0.0012025944888591766, 0.01473238691687584, 0.04585358873009682, -0.0028240568935871124, 0.016163434833288193, 0.027832690626382828, 0.04378769174218178, -0.03811899572610855, 0.023622039705514908, -0.049983441829681396, -0.010542094707489014, 0.008267760276794434, -0.008627437055110931, -0.02527620829641819, 0.03216293826699257, -0.02231825701892376, -0.033121369779109955, 0.037671301513910294, 0.0007341727614402771, -0.03757983446121216, -0.020359491929411888, 0.0393034853041172, 0.0007078871130943298, -0.01959993876516819, -0.008687354624271393, 0.025999579578638077, 0.006793748587369919, -0.021520555019378662, -0.00323554128408432, -0.022732246667146683, -0.0120529904961586, 0.03872206434607506, 0.04727640375494957, -0.003207992762327194, 0.04845309630036354, 0.04049822315573692, 0.018435422331094742, 0.016388144344091415, 0.012343667447566986, -0.042211201041936874, -0.01615145057439804, 0.0037777796387672424, 0.006229449063539505, 0.030347514897584915, -0.015140511095523834], [-0.005767941474914551, 0.03446308150887489, 0.037444841116666794, 0.049245428293943405, -0.03533373028039932, -0.03541532903909683, 0.037428442388772964, -0.04590127617120743, 0.012946952134370804, 0.0053846463561058044, -0.04411546140909195, 0.046802226454019547, 0.016650978475809097, 0.04888024553656578, -0.03377627208828926, 0.01781478151679039, -0.011000178754329681, -0.030862629413604736, -0.041757870465517044, -0.04351183399558067, -0.018814945593476295, -0.015131331980228424, -0.013092804700136185, 0.006345212459564209, 0.01598917320370674, -0.03049454651772976, 0.023465897887945175, 0.04740710183978081, 0.04159301891922951, -0.0023123621940612793, -0.0379495844244957, 0.02673126384615898, -0.02768249623477459, 0.020321380347013474, -0.024442290887236595, -0.014097463339567184, -0.0006706230342388153, -0.03509709984064102, 0.03216877952218056, -0.01880350150167942, 0.03396475687623024, 0.03843308612704277, -0.04261883720755577, -0.03595825284719467, 0.024666491895914078, -0.0309365876019001, -0.018651235848665237, 0.04746946319937706, -0.011633537709712982, -0.018168210983276367, 0.046915922313928604, -0.0029645785689353943, 0.04525791481137276, 0.04022643342614174, 0.008842788636684418, 0.01716076210141182, 0.023682665079832077, 0.028245996683835983, 0.027791108936071396, 0.01816451922059059, 0.010870814323425293, -0.04530226066708565, -0.01389472559094429, -0.0009807571768760681, 0.040169406682252884, 0.020983781665563583, 0.020991791039705276, -0.015914488583803177, -0.034904755651950836, -0.002288438379764557, -0.010650325566530228, 0.0007282495498657227, -0.004560314118862152, 0.004069365561008453, -0.019887268543243408, 0.020136941224336624, 0.014907214790582657, 0.002284802496433258, 0.006955575197935104, -0.002113260328769684, -0.004587255418300629, 0.012652527540922165, 0.007378041744232178, 0.007063604891300201, -0.001845192164182663, -0.02964268997311592, 0.003842674195766449, 0.033174265176057816, -0.02295384369790554, -0.030260706320405006, 0.03131074085831642, 0.03721184656023979, -0.03537726402282715, 0.017422426491975784, 0.010359145700931549, 0.03101276233792305, -0.016400955617427826, 0.001516927033662796, 0.040678028017282486, 0.03337428346276283, -0.01457972452044487, 0.028240446001291275, -0.03546113893389702, -0.0025247223675251007, -0.0014872066676616669, 0.04543459787964821, 0.0036693811416625977, -0.0017820708453655243, -0.01796678453683853, 0.014711428433656693, -0.042498257011175156, 0.010837376117706299, 0.025934133678674698, 0.028743121773004532, -0.03704039007425308, -0.03310196474194527, 0.033798251301050186, 0.01417403295636177, 0.010655879974365234, -0.03697997331619263, 0.03972763195633888, -0.02181105688214302, -0.0035040974617004395, -0.019148552790284157, -0.03336576372385025, 0.024387884885072708, -0.01546330377459526, 0.03392404690384865, -0.02423989772796631, -0.022096121683716774, -0.0024787411093711853, -0.01589953899383545, -0.019037699326872826, -0.017507266253232956, 0.0072155967354774475, 0.04884064570069313, 0.014004793018102646, 0.007862366735935211, -0.005425475537776947, 0.02868194505572319, -0.01716306060552597, -0.00762619823217392, 6.77257776260376e-06, 0.026396144181489944, 0.02798161283135414, 0.030220065265893936, 0.017495084553956985, -0.04511456564068794, -0.014695335179567337, 0.002295352518558502, 0.03783931955695152, 0.01903531327843666, -0.022740840911865234, 0.004028212279081345, 0.031207267194986343, -0.03714026138186455, 0.01284841075539589, -0.031233465299010277, -0.04750471189618111, -0.027286386117339134, 0.006298400461673737, 0.03254152461886406, 0.044885698705911636, -0.04075155407190323, 0.04570357874035835, 0.04708106443285942, 0.037941958755254745, -0.022186433896422386, 0.007791496813297272, 0.03605243191123009, 0.020926956087350845, -0.02019977569580078, 0.012772057205438614, 0.007668305188417435, 0.005332686007022858, 0.007191218435764313, 0.006445575505495071, 0.012853000313043594, 0.035099390894174576, -0.031021226197481155, 0.03147255256772041, 0.02151307836174965, -0.006073690950870514, -0.046314727514982224, -0.027919495478272438, 0.02730795368552208, -0.017550013959407806, 0.017833653837442398, -0.015278063714504242, -0.031304314732551575, -0.01802990585565567, 0.006924130022525787], [-0.006468296051025391, 0.041530441492795944, -0.008702646940946579, -0.04402698203921318, -0.039652012288570404, 0.0016393177211284637, 0.007955778390169144, 0.01805075630545616, 0.02374175563454628, -0.03640683740377426, 0.03480055555701256, 0.02558572217822075, -0.03951502963900566, 0.041571687906980515, -0.024209534749388695, 0.022229347378015518, -0.04263411834836006, 0.02757357433438301, 0.03432992473244667, 0.005936324596405029, -0.024197889491915703, -0.0024569518864154816, 0.044815544039011, 0.03544994816184044, -0.033981405198574066, -0.012184333056211472, -0.00976639986038208, 0.044359419494867325, 0.046638038009405136, 0.012923669070005417, -0.012759864330291748, 0.03619566932320595, -0.0128541961312294, 0.001413930207490921, -0.03449594974517822, -0.006858516484498978, 0.028077874332666397, 0.016338776797056198, 0.0365750826895237, 0.025545012205839157, 0.04889388009905815, 0.03105172887444496, 0.047331955283880234, 0.0034321658313274384, 0.04680274799466133, -0.027706539258360863, -0.0415920615196228, 0.030594024807214737, -0.0337977297604084, -0.04204229265451431, 0.008009027689695358, 0.0352410189807415, -0.03728751093149185, 0.04262587055563927, 0.03410930559039116, 0.03795384243130684, -0.018963027745485306, -0.006939660757780075, 0.0298464335501194, -0.02384096384048462, -0.010269999504089355, -0.0387064591050148, 0.039803240448236465, 0.03333839401602745, -0.006142687052488327, -0.029265547171235085, -0.02592034451663494, 0.03359938785433769, 0.046919021755456924, 0.0029275640845298767, -0.015410996973514557, -0.04662107303738594, 0.005054391920566559, 0.003914274275302887, -0.04441399499773979, 0.019242849200963974, -0.04844921827316284, 0.040555406361818314, 0.027085456997156143, -0.01077040284872055, 0.0497339703142643, 0.004950273782014847, 0.038389887660741806, 0.04852641746401787, -0.03695394843816757, -0.04824576526880264, 0.04121846333146095, 0.02235107496380806, -9.3802809715271e-06, -0.015112876892089844, -0.03742549568414688, 0.04854549095034599, 0.017667297273874283, 0.01659928634762764, -0.042801108211278915, -0.023881448432803154, -0.009418141096830368, -0.023141562938690186, 0.036234330385923386, -0.02059795893728733, -0.01587466150522232, 0.04008268192410469, 0.008268855512142181, -0.02886894904077053, -0.015784848481416702, 0.002154111862182617, -0.0366361141204834, -0.0405757911503315, -0.043283235281705856, 0.045658696442842484, 0.028786253184080124, -0.04526103660464287, -0.006998885422945023, -0.0012506134808063507, -0.027798747643828392, 0.004295803606510162, -0.014823626726865768, 0.0384531132876873, -0.04276784881949425, -0.005330909043550491, 0.009463571012020111, 0.015558529645204544, 0.016037609428167343, 0.045883264392614365, 0.03383314982056618, -0.005253113806247711, -0.01616119220852852, 0.03504996374249458, 0.01263672485947609, -0.025177789852023125, -0.025379670783877373, -0.02156098000705242, 0.017626259475946426, -0.025106430053710938, -0.015297867357730865, -0.020968187600374222, 0.02704007551074028, -0.02017967775464058, -0.044585417956113815, 0.005867026746273041, -0.016370069235563278, 0.03125292435288429, 0.005573630332946777, -0.014346431940793991, -0.0276924017816782, 0.040567729622125626, -0.012892447412014008, 0.023736868053674698, -0.007126521319150925, -0.003334246575832367, -0.025865400210022926, 0.019209910184144974, 0.003528296947479248, 0.021070901304483414, 0.04183191433548927, 0.048262689262628555, -0.03307770565152168, -0.036491502076387405, 0.028847310692071915, 0.038087937980890274, -0.043409109115600586, -0.04582465812563896, -0.0013123266398906708, 0.03633138909935951, 0.013247523456811905, -0.04677453264594078, -0.016390740871429443, 0.00280153751373291, -0.0041230544447898865, 0.027683567255735397, -0.03723124414682388, 0.01883944496512413, -0.02971402369439602, 0.009509611874818802, 0.04220325127243996, 0.040968332439661026, -0.024438489228487015, 0.04983757808804512, -0.04193556308746338, -0.040804922580718994, -0.038226544857025146, -0.0326821431517601, -0.027620280161499977, -0.03174028545618057, -0.04008381441235542, -0.030843114480376244, -0.013942599296569824, 0.0007051937282085419, -0.027405131608247757, 0.044438447803258896, -0.01162559911608696, 0.031607020646333694], [-0.007419131696224213, 0.006928861141204834, 0.02684587612748146, 0.018505845218896866, -0.019824529066681862, -0.04119250923395157, 0.005289923399686813, -0.015462171286344528, -0.01053612306714058, 0.01340952143073082, 0.03548945114016533, 0.022403959184885025, 0.04794735834002495, 0.03872665390372276, 0.020268309861421585, 0.004679180681705475, 0.001484595239162445, -0.0068777091801166534, -0.012014210224151611, -0.03604698181152344, -0.04366962984204292, 0.015584159642457962, 0.022780444473028183, -0.015502702444791794, 0.04708998277783394, 0.017879139631986618, -0.012765932828187943, 0.003413427621126175, 0.004538524895906448, -0.017141319811344147, 0.04378075525164604, 0.014495383948087692, -0.048372913151979446, -0.002924155443906784, -0.01074615865945816, -0.02793891541659832, -0.03794582933187485, 0.00956261157989502, -0.03604166582226753, -0.017390228807926178, -0.015660416334867477, 0.004736006259918213, 0.026691723614931107, 0.00906052440404892, 0.00012384727597236633, 0.02347797527909279, 0.0184357650578022, -0.03066692315042019, 0.028458859771490097, -0.026985837146639824, -0.034823227673769, 0.03481271490454674, -0.04556044563651085, -0.04389519616961479, -0.02743542194366455, 0.005752909928560257, -0.02124391868710518, -0.04607598856091499, -0.0013929381966590881, -0.010797180235385895, -0.026510823518037796, -0.017664004117250443, 0.020973805338144302, 0.033153895288705826, 0.011088717728853226, 0.007939506322145462, 0.040458131581544876, 0.044929925352334976, 0.00042513757944107056, 0.0413241870701313, 0.01516873762011528, -0.03934948518872261, 0.017887357622385025, -0.028157783672213554, -0.01467437669634819, 0.03251777961850166, -0.016291022300720215, 0.018488217145204544, 0.0441473014652729, 0.013257931917905807, -0.028093326836824417, 0.02274329587817192, -0.03680797666311264, 0.04745948687195778, -0.0007789619266986847, 0.022673096507787704, -0.02336134947836399, -0.04175778478384018, -0.028188979253172874, 0.009317945688962936, 0.01903534308075905, 0.04594380035996437, -0.0019593611359596252, 0.017810974270105362, 0.04915870353579521, 0.022846762090921402, -0.04858168587088585, -0.04026510566473007, 0.006378926336765289, -0.013056673109531403, -0.002684306353330612, 0.04728689417243004, -0.04817767068743706, -0.017201315611600876, -0.04470663145184517, 0.01660684123635292, 0.044928018003702164, -0.03859667852520943, -0.04081315919756889, 0.021856550127267838, 0.024162951856851578, -0.039036333560943604, 0.002828489989042282, -0.03578298166394234, 0.0044744983315467834, 0.047074053436517715, 0.018601063638925552, 0.044097039848566055, -0.016036640852689743, -0.015534162521362305, 0.029375124722719193, 0.04469649866223335, 0.013815704733133316, -0.04543426260352135, -0.033920444548130035, 0.0435391403734684, -0.020194530487060547, -0.03911790996789932, -0.027966869994997978, -0.032735489308834076, -0.012868762016296387, -0.04126361757516861, -0.0018089190125465393, 0.03019353374838829, -0.02028815820813179, -0.03543182462453842, -0.04870978742837906, -0.0104440338909626, -0.04389292001724243, -0.0361572727560997, -0.003784347325563431, -0.0444515123963356, -0.007048286497592926, -0.02396019734442234, 0.005446039140224457, -0.027234042063355446, 0.01679886505007744, -0.029955102130770683, -0.024848461151123047, 0.03788144513964653, 0.04373962804675102, 0.03398016467690468, 0.020928967744112015, -0.001840732991695404, 0.03167377784848213, 0.00395815446972847, -0.0026018843054771423, -0.017332255840301514, 0.027446720749139786, 0.019597280770540237, 0.046128179877996445, -0.023658668622374535, 0.0479939840734005, 0.00021163374185562134, 0.015504244714975357, 0.048913631588220596, 0.00988227128982544, 0.027330946177244186, 0.043901171535253525, -0.018576789647340775, -0.03708746284246445, -0.024813998490571976, 0.04566415771842003, 0.0008894912898540497, 0.015192817896604538, 0.010918010026216507, -0.02342594973742962, 0.037304703146219254, 0.015168797224760056, -0.005600392818450928, 0.04957364872097969, 0.021969985216856003, 0.018343333154916763, -0.009111441671848297, 0.04395120218396187, 0.02841125801205635, 0.006090342998504639, 0.020683754235506058, -0.02108060196042061, 0.035380054265260696, -0.03166471794247627, 0.031103361397981644], [-0.0013221502304077148, -0.02149607054889202, -0.025019658729434013, 0.04399702325463295, -0.039389193058013916, 0.009639181196689606, -0.02219679392874241, -0.004049062728881836, -0.0036941878497600555, 0.03222096338868141, -0.036437131464481354, 0.0222184918820858, 0.010980378836393356, 0.030039753764867783, 0.028219174593687057, 0.048385586589574814, -0.012428700923919678, -0.02252824418246746, -0.018321167677640915, 0.029697243124246597, -0.01838357374072075, -0.043892957270145416, -0.008457541465759277, 0.019412938505411148, 0.004045367240905762, 0.0023023486137390137, 0.011092651635408401, 0.02071862295269966, -0.008898474276065826, -0.026405978947877884, -0.008908320218324661, 0.03427865728735924, -0.02939089573919773, -0.02941720560193062, 0.023628320544958115, 0.02765948697924614, -9.710714221000671e-05, 0.0484481118619442, 0.02671927586197853, 0.028001796454191208, 0.023045111447572708, 0.037918638437986374, -0.004603039473295212, 0.025202307850122452, 0.010375667363405228, -0.023768329992890358, -0.008299756795167923, -0.045490968972444534, 0.004763007164001465, 0.039431143552064896, 0.008382666856050491, -0.04995742067694664, -0.027514934539794922, -0.008517347276210785, -0.004912365227937698, -0.04493504762649536, 0.009082280099391937, 0.008770681917667389, 0.020088087767362595, 0.014332938939332962, -0.048695098608732224, 0.03336361423134804, -0.01514512300491333, -0.009847939014434814, 0.006339620798826218, 0.03575272485613823, -0.03312944248318672, -0.012179695069789886, -0.01134413480758667, 0.04698515310883522, 0.03396179899573326, 0.025517236441373825, -0.019689977169036865, -0.0008044727146625519, 0.03482935205101967, -0.015582621097564697, 0.014683637768030167, 0.03526654466986656, 0.0464450977742672, -0.03364875167608261, 0.032923374325037, 0.04860791936516762, -0.02131490781903267, 0.011206530034542084, -0.014165271073579788, 0.03514165058732033, -0.04484684392809868, 0.024921681731939316, -0.042025186121463776, 0.027188453823328018, -0.022816050797700882, -0.022216618061065674, -0.022126734256744385, -0.013193488121032715, -0.016539059579372406, 0.03085586056113243, 0.01004808023571968, 0.04740912839770317, 0.0023924000561237335, -0.02301543951034546, 0.009673584252595901, -0.028327202424407005, 0.015746023505926132, -0.0014544948935508728, -0.010353900492191315, -0.0184691920876503, -0.028238380327820778, 0.049052540212869644, -0.018858302384614944, 0.002217113971710205, -0.010738909244537354, 0.006075512617826462, -0.0393047109246254, 0.01209171861410141, 0.04281632974743843, 0.0071533918380737305, -0.00786224752664566, 0.04192778840661049, -0.0359325185418129, 0.0074088796973228455, 0.04376622661948204, 0.048661019653081894, -0.008091200143098831, -0.010381031781435013, -0.04245637729763985, -0.01411985233426094, 0.044827867299318314, 0.009741116315126419, -0.011896084994077682, -0.03914523124694824, -0.013696469366550446, 0.02291778102517128, 0.006612669676542282, 0.024605248123407364, 0.03203480318188667, 0.02375253662467003, 0.03225891664624214, 0.019287217408418655, 0.015955116599798203, -0.03929802030324936, 0.010632503777742386, 0.03130365535616875, 0.010307349264621735, 0.03284888342022896, 0.004184208810329437, -0.01691216230392456, -0.011513590812683105, -0.0241671334952116, 0.01015019416809082, 0.02132842317223549, 0.006780765950679779, 0.0006647482514381409, -0.04933137819170952, 0.02558741346001625, -0.04538532719016075, -0.03401593118906021, -0.01791512966156006, 0.028914008289575577, -0.046182215213775635, 0.003796827048063278, -0.04244939237833023, -0.007977556437253952, 0.027798186987638474, -0.009444605559110641, 0.02773410454392433, 0.009622704237699509, -0.03368283808231354, -0.000418592244386673, 0.038568366318941116, 0.047103311866521835, 0.03308651223778725, 0.026888404041528702, -0.03146059811115265, 0.04127241298556328, -0.03138694912195206, -0.007872939109802246, 0.009555518627166748, -0.036374080926179886, -0.003131818026304245, 0.027256373316049576, -0.01937335729598999, -0.015997517853975296, -0.023656630888581276, -0.047702040523290634, -0.011240590363740921, 0.03985360637307167, 0.006026469171047211, -0.03589484840631485, -0.04964569956064224, 0.000973772257566452, 0.01249610260128975, 0.008618582040071487]], "dtype": "float32"}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "num_heads": 4, "key_dim": 192, "value_dim": 192, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "seed": null}, "registered_name": null, "build_config": {"shapes_dict": {"query_shape": [null, 8, 192], "value_shape": [null, 8, 192]}}, "name": "multi_head_attention", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_1"}, "registered_name": "Add", "name": "add_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["multi_head_attention", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 192]}, "name": "layer_normalization", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 192]}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 128]}, "name": "dense_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 128], "dtype": "float32", "keras_history": ["dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_2"}, "registered_name": "Add", "name": "add_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["dense_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 192]}, "name": "layer_normalization_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "num_heads": 4, "key_dim": 192, "value_dim": 192, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "seed": null}, "registered_name": null, "build_config": {"shapes_dict": {"query_shape": [null, 8, 192], "value_shape": [null, 8, 192]}}, "name": "multi_head_attention_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_3"}, "registered_name": "Add", "name": "add_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["multi_head_attention_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 192]}, "name": "layer_normalization_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 192]}, "name": "dense_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 128]}, "name": "dense_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 128], "dtype": "float32", "keras_history": ["dense_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add_4"}, "registered_name": "Add", "name": "add_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization_2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["dense_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 8, 192]}, "name": "layer_normalization_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["add_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "data_format": "channels_last", "keepdims": false}, "registered_name": null, "name": "global_average_pooling1d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 192], "dtype": "float32", "keras_history": ["layer_normalization_3", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 192]}, "name": "dense_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 192], "dtype": "float32", "keras_history": ["global_average_pooling1d", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 140119095865808}, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_4", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_1", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 